TestPlans/Home/Home Protect/xml/HPT3_25112014_14.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tem="http://tempuri.org/" xmlns:web="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd">
  <soap:Body>
    <tem:GetQuote>
      <tem:userName>Compare the Market</tem:userName>
      <tem:passWord>1254CTM2014</tem:passWord>
      <tem:quotationDataXml>&lt;web:QuestionData xmlns:web="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
  &lt;web:TitleID&gt;002&lt;/web:TitleID&gt;
  &lt;web:FirstName&gt;Nicola&lt;/web:FirstName&gt;
  &lt;web:LastName&gt;Forteen&lt;/web:LastName&gt;
  &lt;web:DateOfBirth&gt;1973-04-17&lt;/web:DateOfBirth&gt;
  &lt;web:Sex&gt;F&lt;/web:Sex&gt;
  &lt;web:MaritalStatusID originalvalueid="Widowed/Surviving Civil Partner"&gt;4&lt;/web:MaritalStatusID&gt;
  &lt;web:OccupationID originalvalueid="Retired"&gt;R09&lt;/web:OccupationID&gt;
  &lt;web:BusinessID originalvalueid="Retired"&gt;186&lt;/web:BusinessID&gt;
  &lt;web:Email&gt;michael.hudson@emailreaction.org&lt;/web:Email&gt;
  &lt;web:DaytimeTelephoneNumber&gt;01778 852852&lt;/web:DaytimeTelephoneNumber&gt;
  &lt;web:HouseNumber&gt;7&lt;/web:HouseNumber&gt;
  &lt;web:Street1&gt;Westbury Avenue&lt;/web:Street1&gt;
  &lt;web:Street2 /&gt;
  &lt;web:TownCity&gt;Wembley&lt;/web:TownCity&gt;
  &lt;web:County&gt;Middlesex&lt;/web:County&gt;
  &lt;web:Postcode&gt;HA0 4JX&lt;/web:Postcode&gt;
  &lt;web:IsSameAsRiskAddress&gt;1&lt;/web:IsSameAsRiskAddress&gt;
  &lt;web:PropertyHouseNumber&gt;7&lt;/web:PropertyHouseNumber&gt;
  &lt;web:PropertyStreet1&gt;Westbury Avenue&lt;/web:PropertyStreet1&gt;
  &lt;web:PropertyStreet2 /&gt;
  &lt;web:PropertyTownCity&gt;Wembley&lt;/web:PropertyTownCity&gt;
  &lt;web:PropertyCounty&gt;Middlesex&lt;/web:PropertyCounty&gt;
  &lt;web:PropertyPostcode&gt;HA0 4JX&lt;/web:PropertyPostcode&gt;
  &lt;web:IsJointApplicant&gt;0&lt;/web:IsJointApplicant&gt;
  &lt;web:SoleOccupancy originalvalueid="All family members"&gt;1&lt;/web:SoleOccupancy&gt;
  &lt;web:HaveConvictions&gt;0&lt;/web:HaveConvictions&gt;
  &lt;web:BankruptOrCCJOrIVA&gt;0&lt;/web:BankruptOrCCJOrIVA&gt;
  &lt;web:RefusedCancelled&gt;0&lt;/web:RefusedCancelled&gt;
  &lt;web:PreviouslyBoughtHomeInsurance&gt;1&lt;/web:PreviouslyBoughtHomeInsurance&gt;
  &lt;web:StartDate&gt;2014-10-30&lt;/web:StartDate&gt;
  &lt;web:CoverTypeID originalvalueid="Buildings &amp;amp; Contents Cover"&gt;1&lt;/web:CoverTypeID&gt;
  &lt;web:NumberOfYearsInsuranceHeld originalvalueid="5 years or more"&gt;5&lt;/web:NumberOfYearsInsuranceHeld&gt;
  &lt;web:PreviousClaims&gt;1&lt;/web:PreviousClaims&gt;
  &lt;web:Claim xmlns="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd"&gt;
    &lt;web:ClaimDate&gt;2010-01-01&lt;/web:ClaimDate&gt;
    &lt;web:ClaimAmount&gt;1000&lt;/web:ClaimAmount&gt;
    &lt;web:ClaimTypeID originalvalueid="ground heave (upward movement)"&gt;MA&lt;/web:ClaimTypeID&gt;
    &lt;web:ClaimSection&gt;2&lt;/web:ClaimSection&gt;
    &lt;web:ClaimAtCurrentProperty&gt;0&lt;/web:ClaimAtCurrentProperty&gt;
  &lt;/web:Claim&gt;
  &lt;web:Claim xmlns="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd"&gt;
    &lt;web:ClaimDate&gt;2010-01-01&lt;/web:ClaimDate&gt;
    &lt;web:ClaimAmount&gt;1000&lt;/web:ClaimAmount&gt;
    &lt;web:ClaimTypeID originalvalueid="liability issues"&gt;RA&lt;/web:ClaimTypeID&gt;
    &lt;web:ClaimSection&gt;3&lt;/web:ClaimSection&gt;
    &lt;web:ClaimAtCurrentProperty&gt;0&lt;/web:ClaimAtCurrentProperty&gt;
  &lt;/web:Claim&gt;
  &lt;web:HRI xmlns="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd"&gt;
    &lt;web:HRICategoryID originalvalueid="angling equipment"&gt;Z99&lt;/web:HRICategoryID&gt;
    &lt;web:HRIDescription&gt;16 metre Maver Pole&lt;/web:HRIDescription&gt;
    &lt;web:HRIValue&gt;2600&lt;/web:HRIValue&gt;
  &lt;/web:HRI&gt;
  &lt;web:HRI xmlns="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd"&gt;
    &lt;web:HRICategoryID originalvalueid="pearls"&gt;J01&lt;/web:HRICategoryID&gt;
    &lt;web:HRIDescription&gt;Pearly pearls&lt;/web:HRIDescription&gt;
    &lt;web:HRIValue&gt;2700&lt;/web:HRIValue&gt;
  &lt;/web:HRI&gt;
  &lt;web:PropertyTypeID originalvalueid="Mid Terraced House"&gt;19&lt;/web:PropertyTypeID&gt;
  &lt;web:YearBuilt&gt;1999&lt;/web:YearBuilt&gt;
  &lt;web:Bedrooms originalvalueid="Three"&gt;3&lt;/web:Bedrooms&gt;
  &lt;web:WallConstructionID originalvalueid="Stone"&gt;16&lt;/web:WallConstructionID&gt;
  &lt;web:RoofConstructionID originalvalueid="Tile"&gt;15&lt;/web:RoofConstructionID&gt;
  &lt;web:Roof33PercentFlat&gt;1&lt;/web:Roof33PercentFlat&gt;
  &lt;web:DateFlatRoofLastInspected&gt;2004/01/01&lt;/web:DateFlatRoofLastInspected&gt;
  &lt;web:RoofThatched&gt;0&lt;/web:RoofThatched&gt;
  &lt;web:PropertyListed&gt;0&lt;/web:PropertyListed&gt;
  &lt;web:SignsOfSubsidence&gt;0&lt;/web:SignsOfSubsidence&gt;
  &lt;web:IssueRectified&gt;1&lt;/web:IssueRectified&gt;
  &lt;web:underpinned&gt;0&lt;/web:underpinned&gt;
  &lt;web:GoodStateOfRepair&gt;1&lt;/web:GoodStateOfRepair&gt;
  &lt;web:OwnershipTypeID originalvalueid="Mortgaged/Owned - Not rented out"&gt;OWN01&lt;/web:OwnershipTypeID&gt;
  &lt;web:OccupiedWhenID originalvalueid="Occupied Day and Night"&gt;OCC03&lt;/web:OccupiedWhenID&gt;
  &lt;web:ConsecutiveDaysUnoccupiedID originalvalueid="Up to 45"&gt;30&lt;/web:ConsecutiveDaysUnoccupiedID&gt;
  &lt;web:DomesticUseOnly originalvalueid="No business or professional use"&gt;1&lt;/web:DomesticUseOnly&gt;
  &lt;web:PropertyUseType&gt;HOL01&lt;/web:PropertyUseType&gt;
  &lt;web:MainLocksID originalvalueid="UPVC or aluminium door with multi-point locking system"&gt;3&lt;/web:MainLocksID&gt;
  &lt;web:PatioLocksID originalvalueid="No sliding doors or french windows"&gt;1&lt;/web:PatioLocksID&gt;
  &lt;web:OtherLocksID originalvalueid="No other external doors"&gt;5&lt;/web:OtherLocksID&gt;
  &lt;web:KeyOperatedWindows&gt;1&lt;/web:KeyOperatedWindows&gt;
  &lt;web:BurglarAlarm&gt;0&lt;/web:BurglarAlarm&gt;
  &lt;web:NACOSSApproved&gt;0&lt;/web:NACOSSApproved&gt;
  &lt;web:Safe&gt;1&lt;/web:Safe&gt;
  &lt;web:SmokeAlarm&gt;1&lt;/web:SmokeAlarm&gt;
  &lt;web:Within200mWater&gt;0&lt;/web:Within200mWater&gt;
  &lt;web:BuildingsSumInsured&gt;50000&lt;/web:BuildingsSumInsured&gt;
  &lt;web:BuildingsAccidentalDamage&gt;0&lt;/web:BuildingsAccidentalDamage&gt;
  &lt;web:BuildingsVolExcess originalvalueid="100"&gt;100&lt;/web:BuildingsVolExcess&gt;
  &lt;web:ContentsSumInsured&gt;40000&lt;/web:ContentsSumInsured&gt;
  &lt;web:ContentsAccidentalDamage&gt;0&lt;/web:ContentsAccidentalDamage&gt;
  &lt;web:ContentsVolExcess originalvalueid="100"&gt;100&lt;/web:ContentsVolExcess&gt;
&lt;/web:QuestionData&gt;</tem:quotationDataXml>
    </tem:GetQuote>
  </soap:Body>
</soap:Envelope>